package com.nine.one.yuedu.read;

import org.apache.commons.lang3.StringUtils;

/**
 * Author:李王柱
 * 2020/8/14
 */
public class getIdsTest {
    public static void main(String[] args) {
        /*String[] test={"fdsfsd","fdsfdsf","fdsfsdfsd"};
        for (int i=0;i<test.length;i++){
            System.out.println(test[i]);
        }*/
        String formel="29834\n" +
                "29835\n" +
                "29836\n" +
                "29841\n" +
                "29842\n" +
                "29843\n" +
                "29844\n" +
                "29845\n" +
                "29846\n" +
                "29847\n" +
                "29849\n" +
                "29850\n" +
                "29851\n" +
                "29852";
        System.out.println(formel.replace("\n",","));//将换行,替换成,
        //System.out.println(formel.replace("\n","','"));//将换行,替换成包含','的数据库书名
        String xlsx="先婚厚爱：豪门老公宠上瘾\n" +
                "歌落浮华\n" +
                "白纸迷局\n" +
                "倾城一笑只为君\n" +
                "兵诀之热血教师\n" +
                "将军的小花兮事\n" +
                "穿书之女配洗白记\n" +
                "青冥游记之颍川王妃\n" +
                "囚爱霸宠\n" +
                "穿越之路路笙歌\n" +
                "棋子落：鸽临池上\n" +
                "豪门宠妻，前夫要逼婚\n" +
                "捡个神位当神仙\n" +
                "浮生若梦\n" +
                "绝色女神的超凡高手\n" +
                "嘘，锦色不可欺\n" +
                "封天大帝\n" +
                "医撩美男：魅惑天下\n" +
                "最强贵婿\n" +
                "云少，你媳妇又来坑你了\n" +
                "黑白双雄\n" +
                "穿越之缘来是你\n" +
                "早安，主厨大人\n" +
                "异样别恋：斯德哥尔综合症\n" +
                "农门小财妃：世子太能撩\n" +
                "宠妃是个山大王\n" +
                "沐光永无枪火\n" +
                "名门豪娶：顾少，操之过急\n" +
                "天上掉下一个媳妇\n" +
                "盛总，你老婆有毒\n" +
                "重生逆袭人生\n" +
                "暗香疏影\n" +
                "柒上八下：忠犬将军好调教\n" +
                "倾世盛宠：狂医毒妃\n" +
                "红绿瞳，阴阳眼\n" +
                "宠溺一生：老公你别怕，我有房\n" +
                "农门娇妻：渔女不好惹\n" +
                "追妻顾静冬\n" +
                "一宠成瘾：贺少的心尖宝贝\n" +
                "凌少宠妻成瘾\n" +
                "食灵契约\n" +
                "权臣也是逼出来的\n" +
                "危险首席心尖宠\n" +
                "奸妃当道\n" +
                "青青子衿，我心不在\n" +
                "佳偶婚成\n" +
                "金风玉露一相逢\n" +
                "乱世佳人\n" +
                "帝少上线：老婆狠不乖\n" +
                "炮灰逆袭人生\n" +
                "那个姑娘有点怂\n" +
                "妆色撩人：拐个富少来赚钱\n" +
                "妖妃难训：王爷hold不住\n" +
                "古穿今：陆太太她很柔弱\n" +
                "崔小太太要翻身\n" +
                "豪门独爱：帝少的掌心宠\n" +
                "神秘老公惹不起\n" +
                "君引九泽\n" +
                "闪婚甜妻太傲娇\n" +
                "重生之爱上一只小奶狗\n" +
                "愿明月与你同在\n" +
                "只撩不婚\n" +
                "天书奇谈\n" +
                "重生之今生难逃\n" +
                "相逢正当时\n" +
                "插翅难逃：督军的囚宠\n" +
                "忘生楼之轮回珠\n" +
                "金少，你家女王又想造反了\n" +
                "时光是座博物馆\n" +
                "盛世婚宠：顾少，离婚吧\n" +
                "重生之渣男前任追着求上位\n" +
                "双鱼传\n" +
                "郭小兔变形记\n" +
                "富贵吉祥万万年\n" +
                "守护在你的身后\n" +
                "孟婆新传\n" +
                "天机传说\n" +
                "殇思：玄凤戚戚\n" +
                "想我可以，想离没门\n" +
                "乡村少年\n" +
                "将军不做下堂妃\n" +
                "许你一世福运\n" +
                "我家有个小祖宗\n" +
                "绝世王者\n" +
                "嘘，女朋友来了\n" +
                "花式逆袭：腹黑BOSS，强势宠\n" +
                "重生影后：顾少 后会有期\n" +
                "卿心似我心\n" +
                "女仵作之风华天下\n" +
                "异能少女穿越指南\n" +
                "隐婚虐爱：冷爷傲娇妻\n" +
                "超级女团的贴身狂兵\n" +
                "替身娇妻不好惹\n" +
                "逆天神医\n" +
                "通灵娇妻\n" +
                "系统少女致富指南\n" +
                "府君大人\n" +
                "探丸借客\n" +
                "重生之悠闲复仇路\n" +
                "如果梦醒时还在一起\n" +
                "快穿之听说我是恶毒女配\n" +
                "追妻林弯月\n" +
                "重生之嫡家大小姐\n" +
                "重生农女要上天\n" +
                "系统之拯救网瘾少年\n" +
                "斩妖行动1286\n" +
                "99次离婚：首席老公不正经\n" +
                "共剪西窗月\n" +
                "闭婚索爱：宠你到时间的尽头\n" +
                "凤染九霄\n" +
                "夜半惊婚：神秘老公好撩人\n" +
                "嫡妃归来\n" +
                "帅哥帅哥，我爱上你了\n" +
                "我的21岁明星老婆\n" +
                "昏迷不醒：偷吻小娇妻\n" +
                "最后一个驱鬼人\n" +
                "枕边暖宠：boss别惹我\n" +
                "爱不将就\n" +
                "爱你不过欺自己\n" +
                "爱你在心口难开\n" +
                "爱到痴迷却不能说我爱你\n" +
                "独宠娇妻：千金影后不好惹\n" +
                "腹黑首席强势撩妻\n" +
                "西游密码之黄金丝路\n" +
                "鲜婚厚宠：老公，请关灯\n" +
                "先婚厚爱：豪门老公宠上瘾\n" +
                "顶级宠婚：首席老公超给力\n" +
                "当哀家落马以后\n" +
                "农家废女：巧手王爷快入坑\n" +
                "帝女无双\n" +
                "总裁爹地又吃醋了\n" +
                "战神缠宠:渡个桃花劫\n" +
                "覆手繁华：毒娇宠妃\n" +
                "一品神医\n" +
                "无敌恬狗系统";//文档中的名字
        String have="先婚厚爱：豪门老公宠上瘾\n" +
                "歌落浮华\n" +
                "白纸迷局\n" +
                "倾城一笑只为君\n" +
                "兵诀之热血教师\n" +
                "将军的小花兮事\n" +
                "穿书之女配洗白记\n" +
                "青冥游记之颍川王妃\n" +
                "囚爱霸宠\n" +
                "穿越之路路笙歌\n" +
                "棋子落：鸽临池上\n" +
                "豪门宠妻，前夫要逼婚\n" +
                "捡个神位当神仙\n" +
                "浮生若梦\n" +
                "绝色女神的超凡高手\n" +
                "嘘，锦色不可欺\n" +
                "封天大帝\n" +
                "医撩美男：魅惑天下\n" +
                "最强贵婿\n" +
                "云少，你媳妇又来坑你了\n" +
                "黑白双雄\n" +
                "穿越之缘来是你\n" +
                "早安，主厨大人\n" +
                "异样别恋：斯德哥尔综合症\n" +
                "农门小财妃：世子太能撩\n" +
                "宠妃是个山大王\n" +
                "沐光永无枪火\n" +
                "名门豪娶：顾少，操之过急\n" +
                "天上掉下一个媳妇\n" +
                "盛总，你老婆有毒\n" +
                "重生逆袭人生\n" +
                "暗香疏影\n" +
                "柒上八下：忠犬将军好调教\n" +
                "倾世盛宠：狂医毒妃\n" +
                "红绿瞳，阴阳眼\n" +
                "宠溺一生：老公你别怕，我有房\n" +
                "农门娇妻：渔女不好惹\n" +
                "追妻顾静冬\n" +
                "一宠成瘾：贺少的心尖宝贝\n" +
                "凌少宠妻成瘾\n" +
                "食灵契约\n" +
                "权臣也是逼出来的\n" +
                "危险首席心尖宠\n" +
                "奸妃当道\n" +
                "青青子衿，我心不在\n" +
                "佳偶婚成\n" +
                "金风玉露一相逢\n" +
                "乱世佳人\n" +
                "帝少上线：老婆狠不乖\n" +
                "炮灰逆袭人生\n" +
                "那个姑娘有点怂\n" +
                "妆色撩人：拐个富少来赚钱\n" +
                "妖妃难训：王爷hold不住\n" +
                "古穿今：陆太太她很柔弱\n" +
                "崔小太太要翻身\n" +
                "豪门独爱：帝少的掌心宠\n" +
                "神秘老公惹不起\n" +
                "君引九泽\n" +
                "闪婚甜妻太傲娇\n" +
                "重生之爱上一只小奶狗\n" +
                "愿明月与你同在\n" +
                "只撩不婚\n" +
                "天书奇谈\n" +
                "重生之今生难逃\n" +
                "相逢正当时\n" +
                "插翅难逃：督军的囚宠\n" +
                "忘生楼之轮回珠\n" +
                "金少，你家女王又想造反了\n" +
                "时光是座博物馆\n" +
                "盛世婚宠：顾少，离婚吧\n" +
                "重生之渣男前任追着求上位\n" +
                "双鱼传\n" +
                "郭小兔变形记\n" +
                "富贵吉祥万万年\n" +
                "守护在你的身后\n" +
                "孟婆新传\n" +
                "天机传说\n" +
                "殇思：玄凤戚戚\n" +
                "想我可以，想离没门\n" +
                "乡村少年\n" +
                "将军不做下堂妃\n" +
                "许你一世福运\n" +
                "我家有个小祖宗\n" +
                "绝世王者\n" +
                "嘘，女朋友来了\n" +
                "花式逆袭：腹黑BOSS，强势宠\n" +
                "重生影后：顾少 后会有期\n" +
                "女仵作之风华天下\n" +
                "异能少女穿越指南\n" +
                "隐婚虐爱：冷爷傲娇妻\n" +
                "超级女团的贴身狂兵\n" +
                "替身娇妻不好惹\n" +
                "逆天神医\n" +
                "通灵娇妻\n" +
                "系统少女致富指南\n" +
                "府君大人\n" +
                "探丸借客\n" +
                "重生之悠闲复仇路\n" +
                "如果梦醒时还在一起\n" +
                "快穿之听说我是恶毒女配\n" +
                "追妻林弯月\n" +
                "重生之嫡家大小姐\n" +
                "重生农女要上天\n" +
                "系统之拯救网瘾少年\n" +
                "斩妖行动1286\n" +
                "99次离婚：首席老公不正经\n" +
                "共剪西窗月\n" +
                "闭婚索爱：宠你到时间的尽头\n" +
                "凤染九霄\n" +
                "夜半惊婚：神秘老公好撩人\n" +
                "嫡妃归来\n" +
                "帅哥帅哥，我爱上你了\n" +
                "我的21岁明星老婆\n" +
                "昏迷不醒：偷吻小娇妻\n" +
                "最后一个驱鬼人\n" +
                "枕边暖宠：boss别惹我\n" +
                "爱不将就\n" +
                "爱你不过欺自己\n" +
                "爱你在心口难开\n" +
                "爱到痴迷却不能说我爱你\n" +
                "独宠娇妻：千金影后不好惹\n" +
                "腹黑首席强势撩妻\n" +
                "西游密码之黄金丝路\n" +
                "鲜婚厚宠：老公，请关灯\n" +
                "无敌恬狗系统\n" +
                "一品神医\n" +
                "覆手繁华：毒娇宠妃\n" +
                "战神缠宠:渡个桃花劫\n" +
                "总裁爹地又吃醋了\n" +
                "帝女无双\n" +
                "农家废女：巧手王爷快入坑\n" +
                "顶级宠婚：首席老公超给力";//数据库中的名字
      // System.out.println( getNoHave(xlsx,have,"\n"));
    }
    public static String getNoHave(String xlsx,String have,String spli){
        String[] xlsxs=xlsx.split(spli);
        String[] haves=have.split(spli);
        System.out.println(xlsxs.length+":文档条数");
        System.out.println(haves.length+":数据库条数");
        StringBuilder result=new StringBuilder(xlsx);
        for (String oneXls:xlsxs){
            for (String oneHave:haves){
                if (StringUtils.equals(oneHave,oneXls)){
                    int indexOf = result.indexOf(oneHave);
                    int indexOut=indexOf+oneHave.length();
                    result.delete(indexOf,indexOut);
                }
            }
        }
        return result.toString();
    }

}
